DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Mcu_TS_T40D2M10I6R0/include/Reg_eSys_SCG.h
/****************************************************/
/***              SCG_PARAM                       ***/
/****************************************************/
#define SCG_PARAM_RWBITS_MASK32               ((uint32)0x00000000U)

#define SCG_PARAM_DIVPRES_MASK32              ((uint32)0xF0000000U)
#define SCG_PARAM_CLKPRES_MASK32              ((uint32)0x000000FFU)

#define SCG_PARAM_DIVPRES_DIVSLOW_U32         ((uint32)0x10000000U)
#define SCG_PARAM_DIVPRES_DIVBUS_U32          ((uint32)0x20000000U)
#define SCG_PARAM_DIVPRES_DIVPLAT_U32         ((uint32)0x40000000U)
#define SCG_PARAM_DIVPRES_DIVCORE_U32         ((uint32)0x80000000U)

#define SCG_PARAM_CLKPRES_SOSC_U32          ((uint32)0x00000002U)
#define SCG_PARAM_CLKPRES_SIRC_U32          ((uint32)0x00000004U)
#define SCG_PARAM_CLKPRES_FIRC_U32          ((uint32)0x00000008U)
#define SCG_PARAM_CLKPRES_SPLL_U32          ((uint32)0x00000040U)

/****************************************************/
/***              SCG_CSR                         ***/
/****************************************************/
#define SCG_CSR_RWBITS_MASK32               ((uint32)0x00000000U)

#define SCG_CSR_SCS_MASK32                  ((uint32)0x0F000000U)
#define SCG_CSR_DIVCORE_MASK32              ((uint32)0x000F0000U)
#define SCG_CSR_DIVBUS_MASK32               ((uint32)0x000000F0U)
#define SCG_CSR_DIVSLOW_MASK32              ((uint32)0x0000000FU)

#define SCG_CSR_SCS_SOSC_U32                ((uint32)0x01000000U)
#define SCG_CSR_SCS_SIRC_U32                ((uint32)0x02000000U)
#define SCG_CSR_SCS_FIRC_U32                ((uint32)0x03000000U)
#define SCG_CSR_SCS_SPLL_U32                ((uint32)0x06000000U)

/****************************************************/
/***              SCG_RCCR                        ***/
/****************************************************/
#define SCG_RCCR_RWBITS_MASK32                ((uint32)0x0F0F00FFU)

#define SCG_RCCR_SCS_MASK32                   ((uint32)0x0F000000U)
#define SCG_RCCR_DIVCORE_MASK32               ((uint32)0x000F0000U)
#define SCG_RCCR_DIVCORE_SHIFT32              ((uint32)16U)
#define SCG_RCCR_DIVBUS_MASK32                ((uint32)0x000000F0U)
#define SCG_RCCR_DIVBUS_SHIFT32               ((uint32)4U)
#define SCG_RCCR_DIVSLOW_MASK32               ((uint32)0x0000000FU)

#define SCG_SCS_SOSC_U32                ((uint32)0x01000000U)
#define SCG_SCS_SIRC_U32                ((uint32)0x02000000U)
#define SCG_SCS_FIRC_U32                ((uint32)0x03000000U)
#define SCG_SCS_SPLL_U32                ((uint32)0x06000000U)

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_DIVCORE_U32(value)          ((uint32)((uint32)((value) << SCG_RCCR_DIVCORE_SHIFT32) & SCG_RCCR_DIVCORE_MASK32))

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_DIVBUS_U32(value)           ((uint32)((uint32)((value) << SCG_RCCR_DIVBUS_SHIFT32) & SCG_RCCR_DIVBUS_MASK32))

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_DIVSLOW_U32(value)          (((value) & SCG_RCCR_DIVSLOW_MASK32))

/****************************************************/
/***              SCG_VCCR                        ***/
/****************************************************/
#define SCG_VCCR_RWBITS_MASK32                ((uint32)0x0F0F00FFU)

#define SCG_VCCR_SCS_MASK32                   ((uint32)0x0F000000U)
#define SCG_VCCR_DIVCORE_MASK32               ((uint32)0x000F0000U)
#define SCG_VCCR_DIVCORE_SHIFT32              ((uint32)16U)
#define SCG_VCCR_DIVBUS_MASK32                ((uint32)0x000000F0U)
#define SCG_VCCR_DIVBUS_SHIFT32               ((uint32)4U)
#define SCG_VCCR_DIVSLOW_MASK32               ((uint32)0x0000000FU)

/****************************************************/
/***              SCG_HCCR                        ***/
/****************************************************/
#define SCG_HCCR_RWBITS_MASK32                ((uint32)0x0F0FF0FFU)

#define SCG_HCCR_SCS_MASK32                   ((uint32)0x0F000000U)
#define SCG_HCCR_DIVCORE_MASK32               ((uint32)0x000F0000U)
#define SCG_HCCR_DIVCORE_SHIFT32              ((uint32)16U)
#define SCG_HCCR_DIVPLAT_MASK32               ((uint32)0x0000F000U)
#define SCG_HCCR_DIVPLAT_SHIFT32              ((uint32)12U)
#define SCG_HCCR_DIVBUS_MASK32                ((uint32)0x000000F0U)
#define SCG_HCCR_DIVBUS_SHIFT32               ((uint32)4U)
#define SCG_HCCR_DIVSLOW_MASK32               ((uint32)0x0000000FU)

/****************************************************/
/***              SCG_CLKOUTCNFG                  ***/
/****************************************************/
#define SCG_CLKOUTCNFG_RWBITS_MASK32                     ((uint32)0x0F000000U)

#define SCG_CLKOUTCNFG_CLKOUTSEL_MASK32                  ((uint32)0x0F000000U)

#define SCG_CLKOUTCNFG_CLKOUTSEL_SCG_SLOW_CLK_U32        ((uint32)0x00000000U)
#define SCG_CLKOUTCNFG_CLKOUTSEL_SOSC_U32                ((uint32)0x01000000U)
#define SCG_CLKOUTCNFG_CLKOUTSEL_SIRC_U32                ((uint32)0x02000000U)
#define SCG_CLKOUTCNFG_CLKOUTSEL_FIRC_U32                ((uint32)0x03000000U)
#define SCG_CLKOUTCNFG_CLKOUTSEL_SPLL_U32                ((uint32)0x06000000U)

/****************************************************/
/***              SCG_SOSCCSR                     ***/
/****************************************************/
#define SCG_SOSCCSR_RWBITS_MASK32               ((uint32)0x04830001U)

#define SCG_SOSCCSR_SOSCERR_MASK32              ((uint32)0x04000000U)
#define SCG_SOSCCSR_SOSCVLD_MASK32              ((uint32)0x01000000U)
#define SCG_SOSCCSR_LK_MASK32                   ((uint32)0x00800000U)
#define SCG_SOSCCSR_SOSCCMRE_MASK32             ((uint32)0x00020000U)
#define SCG_SOSCCSR_SOSCCM_MASK32               ((uint32)0x00010000U)
#define SCG_SOSCCSR_SOSCERCLKEN_MASK32          ((uint32)0x00000008U)
#define SCG_SOSCCSR_SOSCEN_MASK32               ((uint32)0x00000001U)

#define SCG_SOSCCSR_LK_UNLOCK_U32               ((uint32)0x00000000U) 
#define SCG_SOSCCSR_LK_LOCK_U32                 (SCG_SOSCCSR_LK_MASK32)

