DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Mcu_TS_T40D2M10I6R0/include/Reg_eSys_SCG.h
/****************************************************/
/***         SCG_SPLLCFG                          ***/
/****************************************************/
#define SCG_SPLLCFG_RWBITS_MASK32                   ((uint32)0x001F0700U)

#define SCG_SPLLCFG_MULT_MASK32                     ((uint32)0x001F0000U)
#define SCG_SPLLCFG_MULT_SHIFT32                    ((uint32)16U)
#define SCG_SPLLCFG_PREDIV_MASK32                   ((uint32)0x00000700U)
#define SCG_SPLLCFG_PREDIV_SHIFT32                  ((uint32)8U)

#define SCG_SPLLCFG_SOURCE_SOSC_U32                  ((uint32)0U)
#define SCG_SPLLCFG_SOURCE_FIRC_U32                  ((uint32)1U)

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_SPLLCFG_MULT_U32(value)                 ((uint32)((uint32)((value) << SCG_SPLLCFG_MULT_SHIFT32) & SCG_SPLLCFG_MULT_MASK32))

/** @violates @ref Reg_eSys_SCG_h_REF_2 MISRA 2004 Advisory Rule 19.7, Function-like macros are used for register operations to improve readability.*/
#define SCG_SPLLCFG_PREDIV_U32(value)               ((uint32)((uint32)((value) << SCG_SPLLCFG_PREDIV_SHIFT32) & SCG_SPLLCFG_PREDIV_MASK32))

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/


/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/



#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_SCG_H */

/** @} */
